Revit 2027 API
TransferringProjectStandardsEventArgs.GetExternalItems Method
 Gets the collection of externally added items which should be shown in the Transfer Project Standards dialog as options.
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IDictionary<Guid, string> GetExternalItems()
Public Function GetExternalItems As IDictionary(Of Guid, String)
public:
IDictionary<Guid, String^>^ GetExternalItems()
member GetExternalItems : unit -> IDictionary<Guid, string>
Return Value
IDictionary<Guid, String>
 The external items which are displayed in the Transfer Project Standards UI. GUIDvalue is used to identify the external item string.
See Also
Reference
TransferringProjectStandardsEventArgs Class
Autodesk.Revit.UI.Events Namespace